max-bot-cf/Catalogs/энргУлицыНедобавленныеВФИАС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргУлицыНедобавленныеВФИАС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавленВФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

max-bot-cf/Catalogs/энргУлицыНедобавленныеВФИАС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СформироватьНаименование(СтрокаJSON) Экспорт
	
	яНаименование 					= "";	
	Чтение 							= Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ДанныеАдреса  					= ПрочитатьJSON(Чтение);
	
	Если ЗначениеЗаполнено(ДанныеАдреса.value) Тогда 
		яНаименование	= яНаименование + ДанныеАдреса.value;	
	КонецЕсли;
	
	Возврат яНаименование;	
КонецФункции

Функция ЕстьСоответствиеУлицыВФИАС(Значение, ТипКонтактнойИнформации) Экспорт
	
	ДанныеАдреса 					= УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(Значение, ТипКонтактнойИнформации);
	НаселенныйПунктДетально 		= РаботаСАдресами.ПодготовитьАдресДляВвода(ДанныеАдреса); 	

	ИдентификаторНаселенногоПункта 	= ИдентификаторАдреса(НаселенныйПунктДетально, Ложь);
	

	Если ИдентификаторНаселенногоПункта = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("КоличествоЗаписей", 7000);
	ПараметрыПоиска.Вставить("СтрокаПоиска"		, ПолучитьТолькоИмяУлицы(ДанныеАдреса.street));
	
	ДанныеКлассификатора 			= Обработки.РасширенныйВводКонтактнойИнформации.АдресаДляИнтерактивногоВыбора(ИдентификаторНаселенногоПункта, 7, НаселенныйПунктДетально.AddressType, ПараметрыПоиска);//АдресныйКлассификаторСлужебный.ЗаполнитьАдресаДляИнтерактивногоВыбораВнут(Результат, Родитель, Уровень, ТипАдреса, ДополнительныеПараметры)//
	
	Возврат НайтиСовпаденияПоУлицеИзТаблицыБСП(ДанныеКлассификатора.Данные, ПараметрыПоиска.СтрокаПоиска);	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииУлицыНедобавленнойВФИАС() Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = "АдресНедобавленногоОбъекта";  	
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
		
КонецПроцедуры

#КонецОбласти

#Область РаботаСПоискомУлицВФИАС

// Функция - Найти совпадения по улице из таблицы БСП
//    Данные не всегда возвращаются из РС с адресами. Они могут прийти из сервиса и там полный список улиц. 
// Параметры:
//  ТаблицаДанных	 - ТаблицаЗначений -
//  СтрокаПоиска	 - Строка - Имя улицы
// 
// Возвращаемое значение:
// Булево
//
Функция НайтиСовпаденияПоУлицеИзТаблицыБСП(ТаблицаДанных, СтрокаПоиска)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДанных.Представление КАК Представление
	               |ПОМЕСТИТЬ ДанныеСОтбором
	               |ИЗ
	               |	&ТаблицаДанных КАК ТаблицаДанных
	               |ГДЕ
	               |	ТаблицаДанных.Представление ПОДОБНО &СтрокаПоиска
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДанныеСОтбором.Представление КАК Представление
	               |ИЗ
	               |	ДанныеСОтбором КАК ДанныеСОтбором";
	
	Запрос.УстановитьПараметр("ТаблицаДанных"	, ТаблицаДанных);
	Запрос.УстановитьПараметр("СтрокаПоиска"	, СтрокаПоиска + "%");
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Возврат НЕ РезультатЗапроса.Пустой(); 	
	
КонецФункции 

// Функция - Получить только имя улицы
// В случае когда имя улицы введено в свободной форме 
// Параметры:
//  Улица	 - Строка - Полное имя улицы
// 
// Возвращаемое значение:
// Строка - Имя улицы без дополнений
//
Функция ПолучитьТолькоИмяУлицы(Улица)
	Текст = Улица;
	
	Текст = СтрЗаменить(Текст," ул", "");
	Текст = СтрЗаменить(Текст,"ул ", "");
	Текст = СтрЗаменить(Текст," улица", "");
	Текст = СтрЗаменить(Текст,"улица ", "");
	
	Возврат Текст;
КонецФункции

Функция ИдентификаторАдреса(Адрес, ВключатьУлицу)
	
	ИдентификаторАдреса = Неопределено;
	МаксимальныйУровень = 0;
	Уровни = СопоставлениеУровняАдресаИНаименования(Адрес.AddressType, ВключатьУлицу);
	
	Для каждого Уровень Из Уровни Цикл
		УровеньКлюч = ?(Уровень.Ключ < 10, Уровень.Ключ * 10, Уровень.Ключ);
		Если УровеньКлюч > МаксимальныйУровень
			И Адрес.Свойство(Уровень.Значение + "Id")
			И ЗначениеЗаполнено(Адрес[Уровень.Значение + "Id"]) Тогда
				ИдентификаторАдреса = Адрес[Уровень.Значение + "Id"];
				МаксимальныйУровень = УровеньКлюч;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИдентификаторАдреса;
	
КонецФункции

Функция СопоставлениеУровняАдресаИНаименования(ТипАдреса, ВключатьУлицу)
	Уровни = Новый Соответствие;
	
	Уровни.Вставить(1, "Area");
	Если РаботаСАдресамиКлиентСервер.ЭтоМуниципальныйАдрес(ТипАдреса) Тогда
		Уровни.Вставить(31, "MunDistrict");
		Уровни.Вставить(41, "Settlement");
	Иначе
		Уровни.Вставить(3, "District");
		Уровни.Вставить(4, "City");
	КонецЕсли;
	
	Уровни.Вставить(5, "CityDistrict");
	Уровни.Вставить(6, "Locality");
	Уровни.Вставить(65, "Territory");
	
	Если ВключатьУлицу Тогда
		Уровни.Вставить(7, "Street");
	КонецЕсли;
	
	Возврат Уровни;
КонецФункции

#КонецОбласти

#КонецЕсли
